Documents/ЛБ_ОтменитьСкидкуВЛомбардах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ОтменитьСкидкуВЛомбардах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_СкидкаНаОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_УстановкаОтменаСкидки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиВДокументах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВДокументах</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СкидкаВДокументах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументУстановкиСкидки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_УстановкаСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_УстановкаОтменаСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УстановкаОтменаСкидки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_УстановкаСкидки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаВДокументах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СкидкаВДокументах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановкаСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаСкидки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_СкидкаНаОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_УстановкаОтменаСкидки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиВДокументах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВДокументах</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СкидкаВДокументах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УвеличитьУменьшить</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_УвеличитьУменьшить</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_ОтменитьСкидкуВЛомбардах/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;   
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		ЭтоСуперпользователь = Истина;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		    ЗаполнитьТаблицу(); 
		КонецЕсли;	
	КонецЕсли;	
	ЗаполнитьСписокЛомбардов(); 
	УстановитьСостояниеДокумента();
	
	Если Объект.Проведен Тогда  
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Элементы.СписокЛомбардов.ТолькоПросмотр = Истина;
		Элементы.СкидкиВДокументах.ТолькоПросмотр = Истина;
	КонецЕсли;	

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
  КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу() 
	Для Каждого ЗначениеП Из Метаданные.Перечисления.ЛБ_СкидкаВДокументах.ЗначенияПеречисления Цикл   
		НоваяСтр = Объект.СкидкиВДокументах.Добавить(); 
		НоваяСтр.Использовать = Истина; 
		НоваяСтр.СкидкаВДокументах = Перечисления.ЛБ_СкидкаВДокументах[ЗначениеП.Имя]; 
    КонецЦикла; 	 
КонецПроцедуры 	

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          

&НаСервере
Функция ПолучитьСписокЛомбардов() 
	СписокЛ = Новый СписокЗначений; 
	Для каждого Стр Из Объект.ДокументУстановкиСкидки.Ломбарды Цикл
		Пометка = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", Стр.Ломбард);  
		Строки = Объект.Ломбарды.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда
			Пометка = Истина;
		КонецЕсли;	
	    СписокЛ.Добавить(Стр.Ломбард,,Пометка);
	Конеццикла; 
    Возврат СписокЛ;
КонецФункции	
	
&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;                                                                       
		
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	

&НаСервере
Процедура ПолучитьДокументыСкидки(СкидкаВДокументах = неопределено)
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ Из Объект.Ломбарды Цикл 
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;	     
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ); 
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса())); 
	Запрос.УстановитьПараметр("ПустойДокумент", Документы.ЛБ_УстановкаСкидки.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_УстановкаОтменаСкидкиСрезПоследних.Ломбард КАК Ломбард,
	               |	ВЫБОР
	               |		КОГДА ЛБ_УстановкаОтменаСкидкиСрезПоследних.Отменен
	               |			ТОГДА &ПустойДокумент
	               |		ИНАЧЕ ЛБ_УстановкаОтменаСкидкиСрезПоследних.ДокументСкидки
	               |	КОНЕЦ КАК ДокументСкидки,
	               |	ЛБ_УстановкаОтменаСкидкиСрезПоследних.Отменен КАК Отменен,
	               |	ЛБ_УстановкаОтменаСкидкиСрезПоследних.ДействуетС КАК ДействуетС
	               |ИЗ
	               |	РегистрСведений.ЛБ_УстановкаОтменаСкидки.СрезПоследних(
	               |			&Дата,
	               |			СкидкаВДокументах = &СкидкаВДокументах
	               |				И Ломбард В (&Ломбарды)) КАК ЛБ_УстановкаОтменаСкидкиСрезПоследних"; 

	Для каждого СтрС из Объект.СкидкиВДокументах Цикл
		Если НЕ СтрС.Использовать Тогда
			Продолжить;
		КонецЕсли;	     
		Если НЕ СкидкаВДокументах = неопределено Тогда
			Если НЕ СтрС.СкидкаВДокументах = СкидкаВДокументах Тогда
			    Продолжить;
		    КонецЕсли;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СкидкаВДокументах", СтрС.СкидкаВДокументах);  		
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
		Если ТаблицаЗапроса.Количество() = 0 Тогда 
			СтрС.ДокументУстановкиСкидки = Документы.ЛБ_УстановкаСкидки.ПустаяСсылка(); 
			СтрС.ДействуетС = Дата(1,1,1);
		Иначе	   			
			Для каждого Эл Из СписокЛ Цикл  
				Отбор = Новый Структура;
				Отбор.Вставить("Ломбард", Эл.Значение);
				Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
				Если Строки.Количество() = 0 Тогда
					НоваяСтр = ТаблицаЗапроса.Добавить();
					НоваяСтр.Ломбард = Эл.Значение;  
				КонецЕсли;	
			КонецЦикла;	

			ТаблицаДокументов = ТаблицаЗапроса.Скопировать();
			ТаблицаДокументов.Свернуть("ДокументСкидки");
			Если ТаблицаДокументов.Количество() = 1 Тогда
				Выборка = ТаблицаЗапроса.Получить(0);
			    СтрС.ДокументУстановкиСкидки = Выборка.ДокументСкидки;
				СтрС.ДействуетС = Выборка.ДействуетС;
			Иначе //разные документы 
				ОбщегоНазначения.СообщитьПользователю("Для вида документов """ + Строка(СтрС.СкидкаВДокументах) + """ в выбранных ломбардах установлены разные документы установки скидки. Выбор документа для отмены неоднозначен."); 
				
				Для каждого СтрД Из ТаблицаДокументов Цикл 
					Отбор = Новый Структура;
					Отбор.Вставить("ДокументСкидки", СтрД.ДокументСкидки);  
					Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
					СтрокаЛомбарды = "";
					Для каждого стр Из строки Цикл 
						СтрокаЛомбарды = СтрокаЛомбарды + ?(ПустаяСтрока(СтрокаЛомбарды), "", ", ") + СокрЛП(Стр.Ломбард);
					КонецЦикла;	  
					Если ЗначениеЗаполнено(СтрД.ДокументСкидки) Тогда
				        ОбщегоНазначения.СообщитьПользователю(СтрокаЛомбарды + " документ установки скидки " +  СокрЛП(СтрД.ДокументСкидки));
					Иначе
						ОбщегоНазначения.СообщитьПользователю(СтрокаЛомбарды + " скидка не установлена");
					КонецЕсли;	
				КонецЦикла;
	                     
				СтрС.ДокументУстановкиСкидки = Документы.ЛБ_УстановкаСкидки.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
     Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	
	Если НЕ Объект.Ломбарды.Количество() = 0 Тогда
		ПолучитьДокументыСкидки();
		СписокДок = Новый СписокЗначений;
		Для каждого СтрС Из Объект.СкидкиВДокументах Цикл 
			Если НЕ СтрС.Использовать Тогда  
				Продолжить;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(СтрС.ДокументУстановкиСкидки) Тогда
				СписокДок.Добавить(СтрС.СкидкаВДокументах);
			КонецЕсли;	
		КонецЦикла;	
		Если НЕ СписокДок.Количество() = 0 Тогда
			СтрокаПредупреждения  = "Не определен документ установки скидки:"; 
			Для каждого Эл Из СписокДок Цикл 
				СтрокаПредупреждения = СтрокаПредупреждения + символы.ПС + Строка(Эл.Значение);
			КонецЦикла;	
			Предупреждение(СтрокаПредупреждения, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

 
&НаКлиенте
Процедура СписокЛомбардовОчистка(Элемент, СтандартнаяОбработка)
	Объект.Ломбарды.Очистить();
	СписокЛомбардов = "";
	Объект.СтрокаЛомбарды = "";
	Объект.ДокументУстановкиСкидки = ПредопределенноеЗначение("Документ.ЛБ_УстановкаСкидки.ПустаяСсылка");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если НЕ НачалоДня(ТекущийОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Если НЕ ЭтоСуперпользователь Тогда 
				 Сообщить("Пользователь имеет право проводить документ только текущей датой. Измените дату документа.", статуссообщения.Важное);
			     Отказ = Истина;
				 Возврат;
			КонецЕсли;	
		КонецЕсли;	
		
		ЕстьИспользовать = Ложь; 
		СписокДок = Новый СписокЗначений;
		Для каждого СтрС Из Объект.СкидкиВДокументах Цикл 
			Если НЕ СтрС.Использовать Тогда  
				Продолжить;
			КонецЕсли;	 
			ЕстьИспользовать = Истина;
			Если НЕ ЗначениеЗаполнено(СтрС.ДокументУстановкиСкидки) Тогда
				СписокДок.Добавить(СтрС.СкидкаВДокументах);
			КонецЕсли;	
		КонецЦикла;	  
		
		Если НЕ ЕстьИспользовать Тогда
			ОбщегоНазначения.СообщитьПользователю("Не выбрано ни одного вида документа для отмены",,,);
			Отказ = Истина;
			Возврат;  
		КонецЕсли;	
		Если НЕ СписокДок.Количество() = 0 Тогда
			СтрокаПредупреждения  = "Не определен отменяемый документ скидки для вида документов "; 
			Ном = 0;
			Для каждого Эл Из СписокДок Цикл 
				СтрокаПредупреждения = СтрокаПредупреждения + ?(Ном = 0, "", ", ") + Строка(Эл.Значение); 
				Ном = Ном + 1;
			КонецЦикла;	 
			Сообщить(СтрокаПредупреждения, статуссообщения.Важное);
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
КонецПроцедуры


&НаКлиенте
Процедура СкидкиВДокументахИспользоватьПриИзменении(Элемент)
	ТекСтрока = Элементы.СкидкиВДокументах.ТекущиеДанные;
	Если НЕ ТекСтрока.Использовать Тогда  
		ТекСтрока.ДокументУстановкиСкидки = ПредопределенноеЗначение("Документ.ЛБ_УстановкаСкидки.ПустаяСсылка"); 
		ТекСтрока.ДействуетС = Дата(1,1,1);
	Иначе	
		Если НЕ Объект.Ломбарды.Количество() = 0 Тогда
			ПолучитьДокументыСкидки(ТекСтрока.СкидкаВДокументах);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиВДокументахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если Поле.Имя = "СкидкиВДокументахДокументУстановкиСкидки" Тогда
	    ТекСтрока = Элементы.СкидкиВДокументах.ТекущиеДанные; 
		Если ЗначениеЗаполнено(ТекСтрока.ДокументУстановкиСкидки) Тогда  
			ПараметрыФормы = Новый Структура("Ключ", ТекСтрока.ДокументУстановкиСкидки);
			ОткрытьФорму("Документ.ЛБ_УстановкаСкидки.ФормаОбъекта", ПараметрыФормы); 		
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
